### Домашнее Задание №2
Тема: Вывод текста, ESCAPE-последовательности, RAW-строки

1. Написать программу на чистом Си, которая выводит на экран:
```
"Hello, World!"
/Dennis Ritchi/
```

2. Написать программу на чистом Си++, которая выводит на экран:
```
"Hello, World!"
/Dennis Ritchi/
```
Программа должна использовать поясняющие однострочные комментарии.

3. Написать программу, которая выводит на экран:
```
Hello, World!
\\Dennis Ritchi\\
```
Программа должна использовать поясняющие многострочные комментарии.

4. Выведите следующий текст:
```
To be, or not to be: that is the question:
Whether 'tis nobler in the mind to suffer
The slings and arrows of outrageous fortune,
Or to take arms against a sea of troubles,
And by opposing end them?
 William Shakespeare
```
5. Напишите программу на С++ для вывода следующего текста двумя способами: не используя RAW-строки и используя RAW-строки.
```
C:\Program Files\tablet\amd64\bin>
```
6\*. Создать приложение, которое выводит на экран следующую таблицу:
```
╔════════════════════════════════════════════╗
║ Vremena goda                               ║
╠═════════╦═══════════╦═══════════╦══════════╣
║ Zima    ║   Vesna   ║    Leto   ║   Osen   ║
╚═════════╩═══════════╩═══════════╩══════════╝
```
Подсказка: Рекомедуем выполнить следующий пример
```cpp
cout<<"\n"<<(char)201<<(char)205<<(char)205<<(char)187;
```
Необходимые символы находятся в диапазоне от 179 до 218.
