
1. Написать программу, которая выводит на экран ваши имя и фамилию 10 раз.
```cpp
#include <iostream>
using namespace std;

int main() {
	int x = 0;
	while (x<10) {
		cout << "Vasya Pupkin" << endl;
		x+=1;
	}
}
```

2. Написать программу, которая выводит таблицу квадратов первых десяти целых положительных чисел
```cpp
#include <iostream>
int main(){
  
}
```

3. Написать программу, которая вычисляет сумму первых *n* целых положительных целых чисел. Количество суммируемых чисел должно вводиться во время работы программы.
```cpp
#include <iostream>
int main(){
  
}
```

4. Написать программу, которая выводит таблицу степеней двойки от нулевой до десятой.
```cpp
#include <iostream>
int main(){
  
}
```

5. Вычисление среднего арифметического последовательности дробных чисел.

6. Написать программу, которая генерирует три последовательности из десяти случайных чисел в диапазоне от 1 до 10, выводит каждую последовательность на экран и вычисляет среднее арифметическое каждой последовательности.

7. Написать программу, которая определяет максимальное число из введенной с клавиатуры последовательности положительных чисел (длина последовательности неограниченна). Последнее число - 0.

8. Написать программу, которая "задумывает" число в диапазоне от 1 до 10 и предлагает пользователю угадать число за 5 попыток.

9. Напишите программу, которая выводит на экран таблицу значений функции у = 2\*х\*x-5\*х-8 в диапазоне от -4 до 4. Шаг изменения аргумента 0.5.

10. Напишите программу, которая вычисляет число "Пи" с заданной пользователем точностью. Для вычисления значения числа "Пи" воспользуйтесь тем, что значение частичной суммы ряда 1-1/3+1/5-1/7+1/9-... при суммировании достаточно большого количества членов приближается к значению Пи/4. Рекомендуемый вид экрана во время выполнения программы приведен ниже (данные, введенные пользователем, выделены полужирным шрифтом).

```
Задайте точность вычисления ПИ -> 0.001
Значение числа ПИ с точностью 0.001000 равно 3.143589
Просуммировано 502 члена ряда.
```

11. Написать программу, которая вычисляет наибольший общий делитель двух целых чисел. 


