
1. Написать программу, которая выводит на экран `hello world` 10 раз. [сдаюсь, дай решение](./helloworld.cpp)

output:
```
hello world
hello world
hello world
hello world
hello world
hello world
hello world
hello world
hello world
hello world
```

2. Написать программу, которая выводит таблицу квадратов первых десяти целых положительных чисел. [сдаюсь, дай решение](./square.cpp)

output:
```
1 * 1 = 1
2 * 2 = 4
3 * 3 = 9
4 * 4 = 16
5 * 5 = 25
6 * 6 = 36
7 * 7 = 49
8 * 8 = 64
9 * 9 = 81
10 * 10 = 100
```

3. Написать программу, которая вычисляет сумму первых *n* целых положительных целых чисел. Количество суммируемых чисел должно вводиться во время работы программы.  [сдаюсь, покажи решение](./sum.cpp)

input:
```
3
1
-3
2
3
```
output:
```
6
```

4. Написать программу, которая выводит таблицу степеней двойки от нулевой до десятой. [сдаюсь, покажи решение](./pow2.cpp)

output:
```
2^0 = 1
2^1 = 2
2^2 = 4
2^3 = 8
2^4 = 16
2^5 = 32
2^6 = 64
2^7 = 128
2^8 = 256
2^9 = 512
2^10 = 1024
```

5. Вычисление среднего арифметического последовательности дробных чисел. [сдаюсь, покажи решение](./average.cpp)
input:
```
Enter n: 5
enter a number: 2
enter a number: 4
enter a number: 6
enter a number: 8
enter a number: 9
```
output:
```
average = 5.8
```

6. Написать программу, которая генерирует три последовательности из десяти случайных чисел в диапазоне от 1 до 10, выводит каждую последовательность на экран и вычисляет среднее арифметическое каждой последовательности.
```cpp
#include <iostream>
#include <cstdlib> // rand(), srand() s=seed
#include <ctime>

using namespace std;

int main() {
	srand(time(NULL)); // delaet seed = tekushee vremya

	int i = 0;
	double sum1 = 0.0;
	double r1;
	while (i < 10) {
		r1 = 1 + rand() % 10;
		sum1 += r1;
		cout << r1 << " "; // 1 ... 10
		i++;
	}
	cout << sum1 / 10 << endl;

	int j = 0;
	double sum2 = 0.0;
	double r2;
	while (j < 10) {
		r2 = 1 + rand() % 10;
		sum2 += r2;
		cout << r2 << " "; // 1 ... 10
		j++;
	}
	cout << sum2 / 10 << endl;

	int k = 0;
	double sum3 = 0.0;
	double r3;
	while (k < 10) {
		r3 = 1 + rand() % 10;
		sum3 += r3;
		cout << r3 << " "; // 1 ... 10
		k++;
	}
	cout << sum3/10 << endl;

}
```
7. Написать программу, которая определяет максимальное число из введенной с клавиатуры последовательности положительных чисел (длина последовательности неограниченна). Последнее число - 0.

8. Написать программу, которая "задумывает" число в диапазоне от 1 до 10 и предлагает пользователю угадать число за 5 попыток.

9. Напишите программу, которая выводит на экран таблицу значений функции у = 2\*х\*x-5\*х-8 в диапазоне от -4 до 4. Шаг изменения аргумента 0.5.

10. Напишите программу, которая вычисляет число "Пи" с заданной пользователем точностью. Для вычисления значения числа "Пи" воспользуйтесь тем, что значение частичной суммы ряда 1-1/3+1/5-1/7+1/9-... при суммировании достаточно большого количества членов приближается к значению Пи/4. Рекомендуемый вид экрана во время выполнения программы приведен ниже (данные, введенные пользователем, выделены полужирным шрифтом).

```
Задайте точность вычисления ПИ -> 0.001
Значение числа ПИ с точностью 0.001000 равно 3.143589
Просуммировано 502 члена ряда.
```

11. Написать программу, которая вычисляет наибольший общий делитель двух целых чисел. 


